"(Not You?)|Login - Clickable text letting user log in as a different user" = "(Não és tu?)";

"+%i|Very short string used in place of X names of members of a thread (when the thread name is too long to fit). Ex: +1, +2, +3.  If the language has no short way to express this, use … (ellipsis) or equivalent." = "+%1$i";

",|Punctuation (comma) used to separate entries in a list of names. Example: Alice, Bob, Carol" = ",";

"1 Friend is Nearby|Title of megaphone to encourage user to share location." = "1 amigo está nas proximidades";

"1 day|text to show user was online/active 1 day ago (don't abbrev)" = "1 dia";

"1 hour|text to show user was online/active 1 hour ago (don't abbrev)" = "1 hora";

"1 minute|text to show user was online/active 1 minute ago (don't abbrev)" = "1 minuto";

"1d|short indicator that a user was active 1 day ago" = "1 d";

"1h|short indicator that a user was active 1 hour ago" = "1 h";

"1m Limit: Release to send|notify user that the maximum recording time has been reached" = "Limite de 1 min.: Soltar para enviar";

"1m|short indicator that a user was active 1 minute ago" = "1 min";

"2 days|text to show user was online/active 2 days ago (don't abbrev)" = "2 dias";

"2 hours|text to show user was online/active 2 hours ago (don't abbrev)" = "2 horas";

"2 minutes|text to show user was online/active 2 minutes ago (don't abbrev)" = "2 minutos";

"A new version of Messenger is available.|New version title" = "Está disponível uma versão nova do Messenger.";

"Activation Code|placeholder text for activation code field" = "Código de ativação";

"Activation Request Failed|" = "O pedido de activação falhou";

"Active Now (%d)|Title for chat bar section containing online friends who are not top friends. Number after string is number of friends who are online." = "Activos agora (%1$d)";

"Add Favorite|Title of screen shown when user is adding a new favorite" = "Adicionar favorito";

"Add More People|button for adding people to the conversation" = "Adicionar mais pessoas";

"Add More People|title for add members page" = "Adicionar mais pessoas";

"Add More People|title for add people page" = "Adicionar mais pessoas";

"Add To Conversation|text to show in the add people button" = "Adicionar à conversa";

"Add to Existing Contact|action sheet option for adding a phone number to an existing contact" = "Adicionar a contacto existente";

"Add|generic add button" = "Adicionar";

"Adding...|adding progress text" = "A adicionar...";

"Advanced Settings|text for advanced settings button" = "Definições avançadas";

"Advanced|title for advanced settings page" = "Avançadas";

"Alerts Off Until %@|Indicates that alerts are off until X time" = "Alertas desactivados até %1$@";

"Alerts Off for 1 Hour|Indicates that alerts are off for 1 hour" = "Alertas desactivados durante 1 hora";

"Alerts Off|Indicates that alerts are off" = "Alertas desactivados";

"Alerts On|Indicates that alerts are on" = "Alertas activados";

"All notifications are off for 8h.|footer text for notifications settings applying to all conversations" = "Todas as notificações estão desactivadas durante 8h.";

"All notifications are off.|Mute warning display on thread list" = "Todas as notificações estão desactivadas.";

"Answer|Text for button that accepts a call" = "Atender";

"Archive Thread|Button label that will archive the thread" = "Arquivar conjunto de mensagens";

"Are you sure you want to delete the conversation name?|alert message for deleting conversation name" = "Tens a certeza de que queres eliminar o nome da conversa?";

"Are you sure you want to leave this conversation? You will no longer receive new messages.|confirmation dialog message for leaving a thread" = "Tens a certeza de que queres sair desta conversa? Já não vais receber mensagens novas.";

"Are you sure?|Title for dialog asking the user if they're sure if they want to not enable push notifications" = "Tens a certeza?";

"Attach a Photo|Button label for attaching a photo from the photo library" = "Anexar uma foto";

"Attach media|Accessibility text for button that lets user start attaching photos or other media, as well as emoticons and emoji" = "Anexar conteúdo multimédia";

"Auto Send|Auto send label" = "Envio automático";

"Back|generic nav bar back button" = "Retroceder";

"Bing Image Search|" = "Pesquisa nas Imagens do Bing";

"Call Ended|End call message in non-error case" = "A chamada terminou";

"Call Ended|String shown when the call ends" = "A chamada terminou";

"Call Failed|End call message in error case" = "A chamada falhou";

"Call %@|action sheet option for calling a phone number" = "Ligar a %1$@";

"Camera|Button label for attaching a photo from the camera" = "Câmara";

"Cancel|Title for generic Cancel button." = "Cancelar";

"Choose Photo|action sheet option for choosing a photo from photo library" = "Escolher foto";

"Clear|prompt to clear all unsent messages" = "Limpar";

"Clearing...|Progress text shown while clearing the image for a thread" = "A limpar...";

"Clearing...|Progress text shown while clearing the name for a thread" = "A limpar...";

"Close active chat|Button to close an active chat" = "Fechar chat activo";

"Comment|Comment button title" = "Comentar";

"Compose message to %@|Accessibility label describing a text view to start writing a message to a user with no draft message" = "Escrever mensagem para %1$@";

"Compose message to %@: %@|Accessibility label describing a text view to start writing a message to a user with some appended draft message" = "Escrever mensagem para %1$@: %2$@";

"Confirm Phone|Title of page where user enters their phone number" = "Confirmar telemóvel";

"Connecting|Text shown on call screen while connecting a call" = "Estabelecer ligação";

"Connection Failed|Alert title when connection failed" = "A ligação falhou";

"Connection Lost|End call message in connection lost case" = "Ligação perdida";

"Contact Info|Title of the canonical thread info page." = "Informação de contacto";

"Contacting|Text shown on call screen while contacting another party" = "A contactar";

"Continue|Login - Login Button Title for Keychain Login" = "Continuar";

"Conversation Name|placeholder text in conversation name textfield" = "Nome da conversa";

"Copy Link|Option that pops out after long press on a link in message thread." = "Copiar ligação";

"Copy|action sheet option for copying a string to the clipboard" = "Copiar";

"Could not add new members. Please try again.|message for failing to add members dialog" = "Não foi possível adicionar novos membros. Tenta novamente.";

"Could not retrieve availability|Text shown to an user when the operation to retrieve the other party's callable status fails" = "Não foi possível obter disponibilidade";

"Countries|Title for country picker" = "Países";

"Country|Country - Country placeholder text" = "País";

"Create Group Conversation|button for adding people to the canonical conversation" = "Criar conversa em grupo";

"Create New Contact|action sheet option for creating a new contact" = "Criar novo contacto";

"Currently in a call|Error message when user tries to initiate a call while already in a call" = "Actualmente numa chamada";

"Customize Notification Settings|User education for how to configure conversation alerts" = "Personalizar definições de notificação";

"Decline|Text for button that declines a call" = "Recusar";

"Delete Conversation Name|alert title for deleting conversation name" = "Eliminar nome da conversa";

"Delete Message? It cannot be undone.|text shown when a user swipes to delete a message" = "Eliminar mensagem? Isto não pode ser anulado.";

"Delete|Button to accept deleting the name of a conversation" = "Eliminar";

"Delete|Label for button to delete previous character" = "Eliminar";

"Delete|button text for deleting a message" = "Eliminar";

"Delete|button text for removing an unsent message" = "Eliminar";

"Details|title for message details page" = "Detalhes";

"Discover Who's Nearby|Title of NUX to encourage user to share location." = "Descobre quem está nas proximidades";

"Discover which friends are nearby and let them know you're around.|Description of megaphone to encourage user to share location." = "Descobre que amigos estão nas proximidades e diz-lhes que estás por perto.";

"Discover who's in the area and let them know you're around.|Description of megaphone to encourage user to share location." = "Descobre quem está nas proximidades e diz-lhes que estás por perto.";

"Dismiss|Dismiss the audio recorder" = "Ignorar";

"Don't Delete|Button to decline to delete the name of a conversation" = "Não eliminar";

"Don't Save|Don't save action sheet button" = "Não guardar";

"Done|Title for generic Done button that dismisses a view. This needs to be a short string to avoid truncation." = "Concluído";

"Download|Button title to download an upgrade" = "Transferir";

"Edit|Edit button/label title for chat divebar" = "Editar";

"Email|email field placeholder on login screen" = "E-mail";

"Empty Feedback|Title for empty feedback warning." = "Opinião em branco";

"Enter Code|Enter Code page title" = "Introduzir código";

"Error|error title after failed to load webview" = "Erro";

"Facebook User|Placeholder name for Facebook user whose name is unknown" = "Utilizador do Facebook";

"Failed to add members|title for failing to add members dialog" = "Não foi possível adicionar membros";

"Failed to save your settings.|error message after changing thread alert setting." = "Não foi possível guardar as tuas definições.";

"Favorites|chat bar favorites header title" = "Favoritos";

"Free Call|Text on button that starts a messenger call" = "Chamada gratuita";

"Free Calling Unavailable|Title for dialog explaining that messenger calls are not available" = "Chamada gratuita indisponível";

"Friends of Friends|Table section header for a list of friends of friends search results" = "Amigos de amigos";

"Friends on Messenger|Table title: Friends who have Facebook Messenger" = "Amigos no Messenger";

"Get Directions|action sheet option for viewing a map" = "Obter indicações";

"Get Facebook Messenger|Title of a link that takes the user to download the Facebook Messenger app" = "Obter o Facebook Messenger";

"Get Started|Title for NUX" = "Começar";

"Give us feedback or report a problem|Placeholder text for the report bug or feedback input field" = "Dá-nos a tua opinião ou denuncia um problema";

"Google Image Search|" = "Pesquisa nas Imagens do Google";

"Group Conversation|Create a group conversation divebar label" = "Conversa de grupo";

"Group Conversation|Label at top of online friends list that takes user to new message composer" = "Conversa de grupo";

"Group Info|Title of group thread info page." = "Informação sobre o grupo";

"Help|text for help button" = "Ajuda";

"Hold to Talk|The instruction for holding the record button and talk" = "Manter pressionado para falar";

"I'm sure|Button label confirming the user wants to continue with the selected action" = "Tenho a certeza";

"If you enjoy using %@, would you mind taking a moment to rate this update? Thanks!|Prompt for user to rate the app." = "Se gostas de utilizar %1$@, importaste de classificar esta actualização? Obrigado!";

"Image Search|action sheet option for choosing a photo from image search" = "Pesquisa de imagens";

"Include your location|Title of location NUX when user has not yet made a choice regarding enabling or disabling location services." = "Incluir a tua localização";

"Incomplete contact|Alert title: Newly created contact needs more information" = "Contacto incompleto";

"Incorrect Confirmation Code.|alert title for incorrect confirmation code" = "Código de confirmação incorrecto.";

"Install Facebook Messenger?|The caption to promote users for installing Facebook Messenger app" = "Instalar o Facebook Messenger?";

"Install Messenger to listen to this message and record your own.|The detailed message to tell user that the audio clip feature is not supported on the wilde, and then promote a link for them to download the Facebook Messenger app" = "Instala o Messenger para ouvires esta mensagem ou gravares a tua própria mensagem.";

"Install|Button text to install the Facebook Messenger" = "Instalar";

"Invalid Contact|Alert title: Newly created contact has invalid information" = "Contacto inválido";

"Invalid Country Code|alert title for invalid country code" = "Indicativo de país inválido";

"Invalid Phone Number|alert title for invalid phone number" = "Número de telemóvel inválido";

"Keep everyone in the loop|Detail subtitle for Group Chat NUX slide" = "Mantém todos informados";

"Last Updated: %@|last updated date in pull to refresh header" = "Última actualização: %1$@";

"Learn More|Title for button to learn more about sharing location." = "Saber mais";

"Leave Conversation|leave conversation button" = "Sair da conversa";

"Leave conversation?|confirmation dialog title for leaving a thread" = "Sair da conversa?";

"Leave|Button title for leaving a thread" = "Sair";

"Leaving...|Progress text shown while leaving a thread" = "A sair...";

"Let people in this conversation know where you are.|Text of location NUX when user has not yet made a choice regarding enabling or disabling location services." = "Permitir que as pessoas nesta conversa saibam onde estás.";

"Licenses|Licenses screen title" = "Licenças";

"Licenses|text for licenses button" = "Licenças";

"Like|Like button title" = "Gosto";

"Load Earlier Messages|message for loading earlier messages" = "Carregar mensagens anteriores";

"Loading...|Message presented while waiting for content to load." = "A carregar…";

"Locating You...|Message presented when waiting for an accurate location fix." = "A localizar-te...";

"Location is Disabled|Title for dialog indicating that the app hasn't been granted location permissions" = "A localização está desactivada";

"Location is off for this conversation|Title of location NUX when user turns off location services for the first time." = "A localização está desactivada para esta conversa";

"Location services are off. Turn on to let people in this conversation know where you are.|Text of location NUX when user has disabled location services." = "Os serviços de localização estão desactivados. Activa-os para permitires que as pessoas neste conversa saibam onde estás.";

"Location services are on|Title of location NUX when user has enabled location services." = "Os serviços de localização estão activos";

"Log In to Facebook|Login - Login Button Title for password login" = "Iniciar sessão no Facebook";

"Logged in as %@|Login - Text showing who user is logged in as" = "Com sessão iniciada como %1$@";

"Login Approval Required|title of login approval dialog" = "Aprovação de acesso necessária";

"Login Failed|Invalid login alert title" = "O início de sessão falhou";

"Map|title of map tab" = "Mapa";

"Mark as Unread|Button label that will mark the thread as unread" = "Marcar como não lido";

"Meet Friends on the Go|Title of megaphone to encourage user to share location." = "Encontra amigos onde quer que estejas";

"Message|divebar message button title" = "Mensagem";

"Messages|Messenger module display name" = "Mensagens";

"Messages|name of the app with Facebook brand" = "Mensagens";

"Messenger|The title of the app, used in Appirater's dialog." = "Messenger";

"More Friends (%d)|Title for chat bar section containing friends who are not top friends. Number after string is number of friends who are online or pushable." = "Mais amigos (%1$d)";

"More Friends (%d)|Title for chat bar section containing online friends who are not top friends. Number after string is number of friends who are online." = "Mais amigos (%1$d)";

"More Online Friends|Table title: More friends who are online (but are not top ranked friends)" = "Mais amigos online";

"NOTE: People you add will see all previous messages in this conversation.|warning when adding new people to a thread" = "NOTA: As pessoas que adicionares poderão ver todas as mensagens anteriores desta conversa.";

"Name is Too Long|alert title for long conversation name" = "O nome é demasiado longo";

"Name|Placeholder text: Name of new contact" = "Nome";

"Never miss a message again|Detail subtitle for Push Notification NUX slide" = "Nunca percas novamente uma mensagem";

"Never miss a message from your friends again.|Body of Messenger NUX page 2" = "Não voltes a perder uma mensagem dos teus amigos.";

"New Contact|Button title: Create a new contact" = "Novo contacto";

"New Message|Title of screen shown when user is composing a new message" = "Mensagem nova";

"New version available|Title of alert displayed when new version is available" = "Nova versão disponível";

"Next|Generic button to move to next item" = "Seguinte";

"Next|button label for moving to the next screen" = "Seguinte";

"No Message|dialog title for when user tries to send an empty message" = "Nenhuma mensagem";

"No Recipients|dialog title for when user tries to send to no recipients" = "0 destinatários";

"No Results|Accessibility label describing a contacts search result with no results" = "Sem resultados";

"No locations shared recently.|message on map view when no location has been shared recently" = "0 locais partilhados recentemente.";

"No response.|Error reported when no response is received from the server" = "Sem resposta.";

"No, Thanks|Label on button for user to decline to rate the app" = "Não, obrigado";

"Nobody will see exactly where you are.|Explanation to let user know sharing location will not expose his exact location." = "Ninguém vai ver exatamente onde estás.";

"Not Now|Button text to temporarily ignore the installation message" = "Agora não";

"Not Now|Not now alert popup button" = "Agora não";

"Not Now|Title of button to not share location for now." = "Agora não";

"Not Now|button label for deferring enabling push notifications" = "Agora não";

"Not now|Button title to decline an upgrade" = "Agora não";

"Notifications for This Conversation|Title for per-thread notification settings" = "Notificações para esta conversa";

"Notifications for this conversation are off.|Mute warning display on conversation view" = "As notificações para esta conversa estão desactivadas.";

"Notifications|Label for enabling/disabling notification" = "Notificações";

"OK|Title for generic OK button." = "OK";

"Off Until %@|Short string for indicating that alerts are off until X time" = "Desactivadas até %1$@";

"Off for 1 Hour|Short string for indicating that alerts are off for 1 hour" = "Desactivados durante 1 hora";

"Off|Short string for indicating that alerts are off" = "Desactivados";

"On|Short string for indicating that alerts are on" = "Activados";

"Open in Maps|action sheet option for opening an address in the Maps app" = "Abrir em Mapas";

"Password|password field placeholder on login screen" = "Palavra-passe";

"People in this conversation can see your location on the map.|Text of location NUX when user has enabled location services." = "As pessoas neste conversa podem ver a tua localização no mapa.";

"People|Section title for list of thread participants." = "Pessoas";

"People|title of people tab" = "Pessoas";

"Phone Number|placeholder text for phone number field" = "Número de telemóvel";

"Phone or Email|Placeholder text: Phone or email address of new contact" = "Telemóvel ou e-mail";

"Pin friends you message most|Label when users have no favorites" = "Marca os amigos para quem envias mais mensagens";

"Please check your confirmation code and try again.|alert message for incorrect confirmation code" = "Verifica o teu código de confirmação e tenta novamente.";

"Please check your network connection and try again.|" = "Verifica a tua ligação à rede e tenta novamente.";

"Please check your number and try again.|Error reported when an invalid phone number response is received from the server" = "Verifica o teu número e tenta novamente.";

"Please check your number and try again.|alert message for invalid phone number" = "Verifica o teu número e tenta novamente.";

"Please download the latest version of Facebook Messenger.|Notification displayed to user when a version upgrade is available" = "Transfere a versão mais recente do Messenger do Facebook.";

"Please enter a message or attach a photo|dialog message for when user tries to send an empty message" = "Introduz uma mensagem ou anexa uma foto";

"Please enter a phone number or email.|Alert message: Newly created contact has invalid information" = "Introduz um número de telemóvel ou um e-mail.";

"Please enter a valid country code.|alert message for invalid country code" = "Introduz um indicativo de país válido.";

"Please enter the email and password you use to log in to Facebook.|Invalid login alert message" = "Introduz o e-mail e a palavra-passe que utilizas para iniciar sessão no Facebook.";

"Please enter the person's name and contact information.|Alert message: Newly created contact needs more information" = "Introduz o nome e a informação de contacto da pessoa.";

"Please include a description of your problem.|Message for empty feedback warning." = "Inclui uma descrição do teu problema.";

"Please rate the quality of your call|Prompt for call quality survey" = "Classifica a qualidade da tua chamada";

"Please re-login to renew your session.|Error message for expired session" = "Inicia novamente sessão para actualizares.";

"Please use a shorter conversation name.|alert message for long conversation name" = "Utiliza um nome de conversa mais curto.";

"Preview|title for image preview screen" = "Pré-visualizar";

"Privacy & Terms|text for privacy and terms button" = "Privacidade & Termos";

"Pull down to refresh...|message for pull down to refresh" = "Descer para actualizar…";

"Push notification alerts are off.|Reminder text for when push alerts are off on the phone." = "Os alertas de notificações push estão desactivados.";

"Push notification sounds are off.|Reminder text for when push notification sounds are off on the phone." = "Os sons de notificações push estão desactivados.";

"Push notifications are off.|Reminder text for when push notifications are off on the phone." = "As notificações \"push\" estão desactivadas.";

"Push up to refresh...|message for push up to refresh" = "Subir para actualizar...";

"REC|The record button" = "REC";

"Rate %@|Alert title for asking user to rate this app." = "Classificar %1$@";

"Rate %@|Label on button prompting user to rate the app." = "Classificar %1$@";

"Reach friends wherever they are now — mobile or web.|Body of Messenger NUX page 1" = "Contacta amigos onde quer que eles estejam agora — telemóvel ou web.";

"Reach friends wherever they are now|Detail subtitle for Cross Platform NUX slide" = "Contacta os teus amigos onde quer que eles estejam agora";

"Record Audio|action sheet option for recording some audio" = "Gravar áudio";

"Record Video|action sheet option for recording a video" = "Gravar vídeo";

"Record Voice|Button label for attaching an audio clip" = "Gravar voz";

"Record|Record button for voice message" = "Gravar";

"Record|Record button for voice recording" = "Gravar";

"Recorder failed to start|Error info for users saying the audio recorder failed to start." = "Falha ao iniciar gravador";

"Recording cancelled|Notify user that the recording has been successfully cancelled." = "Gravação cancelada";

"Release to cancel recording|The instruction to user: release the record button to cancel the recording." = "Soltar para cancelar gravação";

"Release to refresh...|message for releasing to refresh" = "Soltar para actualizar...";

"Remind Me Later|Label on button allowing the user to postpone rating the app." = "Lembrar-me mais tarde";

"Remove Attachment|action sheet option for removing current attachment" = "Remover anexo";

"Remove Photo|action sheet option for removing chosen photo" = "Eliminar foto";

"Remove Photo|action sheet option for removing current attachment" = "Eliminar foto";

"Removing...|text for removing progress" = "A remover...";

"Report a Problem|title for give feedback or report bug" = "Denunciar um problema";

"Resend|Resend - Resend Button Title" = "Reenviar";

"Retry|generic retry button" = "Tentar novamente";

"Save Photo|action sheet option to save photo to library" = "Guardar foto";

"Save photo as conversation image?|" = "Guardar foto como imagem de conversação?";

"Save|" = "Guardar";

"Saving...|Progress text shown while saving a new image for a thread" = "A guardar…";

"Saving...|Progress text shown while saving a new name for a thread" = "A guardar...";

"Search for Friends|Accessibility label for button that toggles display of friends list/search" = "Pesquisar amigos";

"Search for More Friends…|Label at bottom of online friends list that lets user search for more friends" = "Pesquisar mais amigos…";

"Search to add favorites|placeholder in edit favorites search bar" = "Pesquisar para adicionar favoritos";

"Search|placeholder in search bar" = "Pesquisa";

"Searching...|Placeholder text in a search results list that indicates a contact search is ongoing" = "A pesquisar...";

"See which friends are within walking distance or visiting your city, and let them know you're nearby.|Description of NUX to encourage user to share location." = "Vê que amigos estão a uma curta distância, que pode ser percorrida a pé, ou visita a tua cidade e permite que os teus amigos saibam que estás por perto.";

"Seen by Everyone|Seen state text for when everyone has seen the message." = "Vista por todos";

"Seen by everyone|Seen state text for when everyone has seen the message." = "Vista por todos";

"Seen by %@ %@|Text for when a message has been seen by 1 person at a certain time or date/time. eg. (Seen by <name> <time>)" = "Vista por %1$@ - %2$@";

"Seen by %@|Text for when a message has been seen by 1 person" = "Vista por %1$@";

"Seen by %@|Text for when a message has been seen by more than 1 person" = "Vista por %1$@";

"Seen by:|Text for seen state header" = "Vista por:";

"Seen %@ near %@|Text for when a message has been sen at a certain time (or date/time) and location e.g. (Seen 3:33 PM near Palo Alto)" = "Vista - %1$@, perto de %2$@";

"Seen %@|Text for when a message has been seen at a certain time or date/time. eg. (Seen 3:33PM) or (Seen Mon 3:33PM)" = "Vista - %1$@";

"Select country code|select country code text" = "Selecionar indicativo do país";

"Send to Phone, Chat and Web|Call to action for Cross Platform NUX slide" = "Enviar para telemóvel, chat e web";

"Send|Nav bar send button text" = "Enviar";

"Send|Send button for voice message" = "Enviar";

"Send|text to show in the send button" = "Enviar";

"Sending...|sending progress text" = "A enviar…";

"Sent a message|default notification text for messages with no body text" = "Enviou uma mensagem";

"Sent from Messenger|indicator that a message was sent from Messenger" = "Enviada através do Messenger";

"Sent from email|indicator that a message was sent from email" = "Enviada por e-mail";

"Sent from mobile|indicator that a message was sent sent from a mobile device" = "Enviada por telemóvel";

"Sent from web|indicator that a message was sent sent from web or chat" = "Enviada através da web";

"Sent from %@|Text used for showing the location where a message was sent from. e.g (city) or (city, state) or (city, country)." = "Enviada de %1$@";

"Session Expired|Error title for expired session" = "A sessão expirou";

"Settings App > General > Location Services|Location of Location Services Settings page for before 4.3." = "Definições de aplicações &gt; Geral &gt; Serviços de localização";

"Settings App > Location Services|Location of Location Services Settings page for 4.3 or later." = "Definições de aplicações > Serviços de localização";

"Settings App > Privacy > Location Services|Location of Location Services Settings page for 6.0 or later." = "Definições de aplicações &gt; Privacidade &gt; Serviços de Localização";

"Settings|Settings alert popup button" = "Definições";

"Settings|title for settings page" = "Definições";

"Settings|title of settings tab" = "Definições";

"Share|Share button title" = "Partilhar";

"Shared a link|text for a link share" = "Partilhou uma ligação";

"Shared a photo|text for a photo share" = "Partilhou uma foto";

"Shared a video|text for a video share" = "Partilhou um vídeo";

"Sign Up for Facebook|Sign Up - Sign Up Button Title" = "Registar-me no Facebook";

"Skip|Skip - Skip Button Title" = "Ignorar";

"Something went wrong. Want to try again?|retry dialog message" = "Ocorreu um erro. Tentar novamente?";

"Sorry, something went wrong|Generic error message for Web browser errors" = "Desculpa, mas ocorreu um erro";

"Start Group Chats|Call to action for Group Chat NUX slide" = "Começa chats de grupo";

"Stop attaching media|Accessibility text for button that lets user stop attaching photos or other media, as well as emoticons and emoji" = "Deixar de anexar conteúdo multimédia";

"Stop|Stop button for voice recording" = "Parar";

"Submit|Submit button title" = "Enviar";

"Switch Account|text for switching logged in user" = "Mudar conta";

"Switch to Wi-Fi to complete your call|Error case when calls not allowed over cellular data. Suggest user switch to WiFi instead." = "Muda para o Wi-Fi para completares a tua chamada";

"Take Photo|action sheet option for taking a photo" = "Tirar foto";

"Tap \"Try Again\" to send this message.|prompt for how to resend a failed message send" = "Clica em \"Tentar novamente\" para enviares esta mensagem.";

"Tap gear to turn on chat|placeholder in search bar when offline" = "Toca na engrenagem para activares o chat";

"Tap to discover who's in the area|Message of in-app notification explaining that user can tap to learn more about sharing location." = "Toca para descobrires quem está nesta área";

"Tap to return to call|Message shown on in-call bar explaining that the user may tap on it to return to the call screen" = "Toca para voltares à chamada";

"Tap to send a message|Message of in-app notification explaining that user can tap to message to nearby friends." = "Toca para enviares uma mensagem";

"Tap to turn on location|Title of location NUX when user has disabled location services." = "Toca para activares a localização";

"Text messages can't be sent to that number.|Error reported when a phone number with an unsupported mobile carrier is on the recipients list of a message." = "Não é possível enviar mensagens de texto para esse número.";

"Text your friends wherever they are - on their phones or on chat.|The description message to promote users for installing Facebook Messenger app" = "Envia mensagens aos teus amigos onde quer que eles estejam - nos seus telefones ou no chat.";

"That phone number is not allowed to receive text messages.|Error reported when an unlaunched phone number is on the recipients list of a message." = "Esse número de telemóvel não está autorizado a receber mensagens de texto.";

"There was a problem connecting to Facebook. Please check your connection and try again.|error message for failing to connect to Facebook" = "Ocorreu um problema ao estabelecer ligação com o Facebook. Verifica a tua ligação e tenta novamente.";

"There was a problem connecting your call. Please connect to Wi-Fi and try again.|Alert body message when connection failed suggesting user switch to wifi" = "Ocorreu um problema ao estabelecer a tua ligação. Liga-te ao Wi-Fi e tenta novamente.";

"This Conversation|header text for alert settings applying to a single conversation" = "Esta conversa";

"Timeline|Button text to go to a user's timeline" = "Cronologia";

"Timeline|divebar timeline button title" = "Cronologia";

"Tip: Never Miss a Message|Title for reminder to turn on push notifications" = "Dica: Nunca percas uma mensagem";

"To accept calls, you need to update to the new version of Messenger.|Error dialog body shown when an incoming call failed because the current version is outdated" = "Para aceitares chamadas, tens de fazer a actualização para a nova versão do Messenger.";

"To complete your phone number activation, please enter the activation code|" = "Para concluíres a ativação do teu número de telemóvel, introduz o código de ativação";

"To include location with your messages, go to your %@.|Alert dialog instructing the user how to re-enable location permission. The variable is 'Settings App > Location Services' or 'Settings App > General > Location Services'" = "Para incluíres a localização nas tuas mensagens, vai a %1$@.";

"To make calls, you need to update to the new version of Messenger.|Error dialog body. Shown when a user attempts to make a VoIP call but their version is incompatible." = "Para fazeres chamadas, tens de fazer a actualização para a nova versão do Messenger.";

"To turn off alerts for this conversation, go to conversation settings.|User education for how to configure conversation alerts" = "Para desativar os alertas desta conversa, acede às definições de conversa.";

"To turn off location for all your conversations, go to your %@.|Text of location NUX when user turns off location services for the first time. The parameter is the location of the Location Services in the Settings app (ie. Settings App > Location Services)" = "Para desactivares a localização para todas as tuas conversas, vai a %1$@.";

"To turn on notifications, visit iPhone Settings %@ Notifications %@ Messenger|Body of dialog telling the user how to enable push notifications" = "Para ativares as notificações, visitas as Defonições do iPhone %1$@ Notificações %2$@ Messenger";

"To use this feature, go to your %@ settings and choose Location Services. Select ON for Facebook.|Error explanation when location services are unavailable. {name1} is the name of the current device, e.g. iPhone." = "Para utilizares esta funcionalidade, vai às tuas definições de %1$@ e escolhe Serviços de Localização. Selecciona Activar para o Facebook.";

"To use this feature, go to your %@ settings and tap Privacy, then Location Services. Select ON for Facebook.|Error explanation when location services are unavailable. {name1} is the name of the current device, e.g. iPhone." = "Para utilizares esta funcionalidade, vai às tuas definições do %1$@, toca em Privacidade e, em seguida, em Serviços de Localização. Seleciona Ativados para o Facebook.";

"To|Accessibility label for to field in contact picker" = "Para";

"To:|to field in contact picker" = "Para:";

"Touch and hold to talk.\nRelease to send, or slide off the button to cancel.|Instruction text for holding voice record button, letting go to send, and dragging finger off to cancel message" = "Toca e mantém pressionado para falares.\nSolta para enviares ou tira o dedo do botão para cancelares.";

"Try Again|button text for resending an unsent message. this is referred to in the prompt Tap \"Try Again\" text" = "Tenta novamente";

"Turn Off Chat|Button title to let the user change their chat status from online to offline" = "Desligar o chat";

"Turn Off Until 8am|Option to turn off alerts until 8am" = "Desactivar até às 8h00";

"Turn Off for 1h|Option to turn off alerts for 1 hour" = "Desactivar durante 1 h";

"Turn Off|Option to turn off alerts" = "Desactivar";

"Turn On Chat|Button title to let the user change their chat status from offline to online" = "Ligar o chat";

"Turn On Location Services|Error message title when location services are unavailable." = "Ativar Serviços de Localização";

"Turn On Notifications|Call to action in NUX encouraging user to turn on push notifications" = "Activa notificações";

"Turn On Notifications|Title of dialog telling the user how to enable push notifications" = "Activar notificações";

"Turn On|Option to turn on alerts" = "Activar";

"Turn On|Turn on alerts" = "Activar";

"Turn On|button label for deferring enabling push notifications" = "Activar";

"Turn on Push Notifications|Call to action for Push Notification NUX slide" = "Ativa as notificações push";

"Turn on push notifications to find out when new messages arrive.|Message for reminder to turn on push notifications" = "Ativa as notificações push para saberes quando recebes mensagens novas.";

"Typing…|Text for when the other user is typing. Ends with an ellipsis (U+2026) and is lower-case." = "A escrever…";

"Unable to Call %@|Error dialog title. Shown when app must be updated" = "Não é possível telefonar para %1$@";

"Unable to Play Voice Message|The message to show when user receives a voice message but his app doesn't support playing it back." = "Não é possível reproduzir mensagem de voz";

"Unable to Save Image|retry dialog title for setting thread image" = "Não é possível guardar a imagem";

"Unable to Send|Title for send feedback failed warning." = "Não é possível enviar";

"Unable to add more people to the conversation. Please try again.|error message for failing to add people" = "Não é possível adicionar mais pessoas à conversa. Tenta novamente.";

"Unable to name your conversation.|error message after setting conversation name" = "Não é possível atribuir um nome à tua conversa.";

"Unable to remove you right now.|error messages after leaving conversation" = "Não é possível remover-te agora.";

"Unable to save messaging favorites to Facebook|error message for failing to save messaging favorites" = "Não é possível guardar favoritos de mensagens no Facebook";

"Unable to send message. Retry?|Alert text for when a message failed to send that also asks user to retry." = "Não é possível enviar mensagem. Tentar novamente?";

"Unable to send message.|Alert text for when a message failed to send." = "Não é possível enviar mensagem.";

"Unable to send right now.|error message for failing to send message" = "Não é possível enviar agora.";

"Unpin|button title to remove user from favorites" = "Desmarcar";

"Update|Get new version now button." = "Actualizar";

"Updating...|updating progress text" = "A actualizar...";

"Upgrade Now|button text on alert dialog prompting user to upgrade app" = "Actualizar agora";

"Use|use nav bar button in photo preview screen" = "Utilizar";

"View Call|Text show on button that views an incoming call" = "Ver chamada";

"View in Maps|action sheet option for viewing a map" = "Ver nos Mapas";

"View|Alert button that takes user to the thread where a message failed to send" = "Visualizar";

"We'll text you a link to confirm your number.|Confirmation information text" = "Vamos enviar-te uma ligação para confirmares o teu número.";

"Welcome to Messenger|Title for NUX page" = "Bem-vindo/a ao Messenger";

"Who would you like to send this message to?|dialog message for when user tries to send message to no recipients" = "A quem gostarias de enviar esta mensagem?";

"You can control this in your privacy settings.|Explanation to let user know he can change settings of sharing location." = "Podes controlar isto nas tuas definições de privacidade.";

"You will get an SMS or email shortly with a code to use for logging in.|message in login approval dialog" = "Vais receber em breve um SMS ou um e-mail com um código para utilizares para iniciar sessão.";

"You won't find out when you've received a message.|Body of dialog encouraging the user to enable push notifications" = "Não vais saber quando tiveres recebido uma mensagem.";

"Your carrier doesn't allow calling with Messenger. Please turn on Wi-Fi in your phone settings.|Error message when user tries to initiate a call if carrier doesn't allowVOIP and not on wifi" = "O teu operador não permite chamadas com o Messenger. Activa o Wi-Fi nas definições do teu telefone.";

"Your message was not sent.|text shown when a message failed to send" = "A tua mensagem não foi enviada.";

"Your messages were not sent.|text shown when more than 1 message failed to send" = "As tuas mensagens não foram enviadas.";

"…|Ellipsis (U+2026) used to represent a chat message that is currently being written" = "…";

"active 1d ago|indicator that a user was active 1 day ago" = "activo/a há 1 dia";

"active 1h ago|indicator that a user was active 1 hour ago" = "activo/a há 1 h";

"active 1m ago|indicator that a user was active 1 minute ago" = "activo/a há 1 min";

"active now|indicator that a user is currently active, on web or mobile" = "activo/a agora";

"active on mobile %@ ago|presences status for being active on mobile a relative time ago" = "ativo no telemóvel há %1$@";

"active on mobile|presences status for being active on mobile" = "activo no telemóvel";

"active %id ago|indicator that a user was active 2+ days ago" = "activo/a há %1$i d";

"active %ih ago|indicator that a user was active 2+ hours ago" = "activo/a há %1$i h";

"active %im ago|indicator that a user was active 2+ minute ago" = "activo/a há %1$i min";

"active %@ ago|presences status for being active a relative time ago" = "ativo há %1$@";

"error|A short message for audio play error" = "erro";

"is calling|text below the caller's name when they are calling" = "está a telefonar";

"is typing…|text for when the other user is typing. ends with an ellipsis (U+2026) and is lower-case. name appears on left" = "está a escrever…";

"on mobile|presences status for being available on mobile" = "no telemóvel";

"online %@ ago|presences status for being online on the web a relative time ago" = "online há %1$@";

"online|presences status for being online on the web" = "online";

"typing…|text for when the other user is typing. ends with an ellipsis (U+2026) and is lower-case." = "a escrever…";

"%d of %d|Title on photo viewer screen showing which photo is currently displayed. eg. 2 of 3" = "%1$d de %2$d";

"%i Friend of Friends|Number of friends of friends in search result (singular)" = "%1$i amigo de amigos";

"%i Friend|Number of friends in search result (singular)" = "%1$i amigo";

"%i Friends of Friends|Number of friends of friends in search result (plural)" = "%1$i amigos de amigos";

"%i Friends|Number of friends in search result (plural)" = "%1$i amigos";

"%i days|text to show user was online/active N days ago (don't abbrev)" = "%1$i dias";

"%i hours|text to show user was online/active N hours ago (don't abbrev)" = "%1$i horas";

"%i minutes|text to show user was online/active N minutes ago (don't abbrev)" = "%1$i minutos";

"%id|short indicator that a user was active 2+ days ago" = "%1$i d";

"%ih|short indicator that a user was active 2+ hours ago" = "%1$i h";

"%im|short indicator that a user was active 2+ minute ago" = "%1$i min";

"%@  •  %@|Seen state text for a user in a group detail page. eg. (name <bullet-character> time)" = "%1$@  •  %2$@";

"%@ and %@ use Facebook Messenger|Upsell message for promoting Facebook Messenger. It shows how many your friends are already using Messenger" = "%1$@ e %2$@ utilizam o Facebook Messenger";

"%@ are Nearby|Title of in-app notification showing some friends are nearby. E.g. Tom, Jerry, +2 are Nearby" = "%1$@ estão nas proximidades";

"%@ is Nearby|Title of in-app notification showing some friend is nearby. E.g. Tom is Nearby" = "%1$@ está nas proximidades";

"%@ is calling|Message notifying of an incoming call. First parameter is the name of the caller" = "%1$@ está a telefonar";

"%@ is in another call|End call message notifying caller that callee is unavailable. First parameter is the name of the callee" = "%1$@ está noutra chamada";

"%@ is not available|End call message notifying caller that callee is unavailable. First parameter is the name of the callee" = "%1$@ não está disponível";

"%@ is typing…|string format text for when the other user is typing. ends with an ellipsis (U+2026) and is lower-case. name appears on left" = "%1$@ está a escrever…";

"%@ tried to call you|Error dialog title shown when an incoming voice call can't be received" = "%1$@ tentou telefonar-te";

"%@ uses Facebook Messenger|Upsell message for promoting Facebook Messenger. It shows how many your friends are already using Messenger" = "%1$@ utiliza o Facebook Messenger";

"%@|Name of a person (used both standalone and in lists). Add honorifics (-san, etc.) if appropriate." = "%1$@";

"%@, %i more|List of user names and X more if the list is truncated at N names." = "%1$@, mais %2$i";

"%@, %@ and %@ use Facebook Messenger|Upsell message for promoting Facebook Messenger. It shows how many your friends are already using Messenger" = "%1$@, %2$@ e %3$@ utilizam o Facebook Messenger";

"%@, %@, %@ and 1 other friend use Messenger|Upsell message for promoting Facebook Messenger. It shows how many your friends are already using Messenger" = "%1$@, %2$@, %3$@ e 1 outro amigo utilizam o Messenger";

"%@, %@, %@ and %i other friends use Messenger|Upsell message for promoting Facebook Messenger. It shows how many your friends are already using Messenger" = "%1$@, %2$@, %3$@ e %4$i outros amigos utilizam o Messenger";

"%@…|a string that has been shortened adding ellipsis (unicode 2026)" = "%1$@…";

"%u Friend is Nearby|Title of in-app notification showing some friend is nearby. E.g. 1 Friend is Nearby" = "%1$u amigo está nas proximidades";

"%u Friends are Nearby|Title of in-app notification showing some friends are nearby. E.g. 2 Friends are Nearby" = "%1$u amigos estão nas proximidades";

"%u Friends are Nearby|Title of megaphone to encourage user to share location. E.g. 2 Friends are Nearby." = "%1$u amigos estão nas proximidades";

"%u of your friends are sharing when they're nearby|Message to let user know how many of his friends are sharing location." = "%1$u dos teus amigos estão a partilhar quando estão nas proximidades";

"%u photo attached|Accessiblity text for a single photo" = "%1$u foto em anexo";

"%u photos attached|Accessibility text for a photo set" = "%1$u fotos em anexo";

